# ДЗ 4.2. Знайти суму елементів із парними індексами
# Для списку цілих чисел потрібно знайти суму елементів із парними індексами [0-й, 2-й, 4-й ітд],
# потім перемножити цю суму на останній елемент вхідного масиву.
# Не забудьте, що перший елемент масиву має індекс 0.
# Для порожнього масиву результат завжди 0.
#
input_array = [0, 1, 7, 2, 4, 8]

if not input_array:  # перевірка порожнього списку
    result = 0
else:
    sum_even = sum(input_array[i] for i in range(0, len(input_array), 2))  # знаходимо суму елементів з парними індексами
    result = sum_even * input_array[-1]  # перемножуємо цю суму на останній елемент

print("Результат:", result)
