# ДЗ 4.3. Список із 3 елементів
# Створіть список випадкових чисел із випадковою кількістю елементів від 3 до 10.
# Ваше завдання - створити новий список з 3 елементів початкового списку - першим, третім і другим з кінця.
#
#через рендом бібліотеку
import random

# Генеруємо випадкову кількість елементів у списку (від 3 до 10)
num_elements = random.randint(3, 10)

# Генеруємо список випадкових чисел
random_list = [random.randint(0, 100) for _ in range(num_elements)]

print("Початковий список:", random_list)

# Створюємо новий список з 3 елементів початкового списку...
new_list = [random_list[0], random_list[-3], random_list[-2]]

print("Новий список:", new_list)


#Клікаемо декілька разів для нової генерації