# Написати програму, яка просить користувача ввести 4-х значне число з клавіатури,
# після чого друкує на екрані стовпчик цифр, з якого це число складається. Наприклад, користувач вводить 1234, а програма виводить:
# 1
# 2
# 3
# 4
# Завдання необхідно вирішити, використовуючи методи поділу (підказка // і % або divmod).
# Виведення в стовпчик можна зробити за допомогою 4-х функцій print.
#
# Користувач може ввести будь-яке 4 значне ціле число. Будь-яке 4-х значне число - це число,
# яке складається з 4-х цифр, де кожна цифра може бути від 0 до 9 включно.
#
# Ваше рішення має це враховувати! Якщо користувач ввів не ціле число, це проблема користувача, а не вашої програми.
#
# Створюйте рішення, виходячи з того, що число ЗАВЖДИ 4-х значне.

number = int(input("Введите 4х значное число: "))

#задаём функциональность им, аля как в екселе работа с впр
n1 = (number // 1000)
n2 = ((number % 1000) // 100)
n3 = (number % 100 // 10)
n4 = (number % 10)

#их вывод
print(n1)
print(n2)
print(n3)
print(n4)

print("Результат вашего ввода")