# Ваше завдання — написати програму, яка перемножує всі цифри,
# введені користувачем цілого числа, поки воно не стане менше або дорівнювати 9.
# Користувач вводить число з клавіатури.
# Приклади:
#
# Copy code
# 999 -> 2 # Ось чому - 999 розбиваємо на цифри і перемножуємо 9 * 9 * 9 = 729,
# # Потім 7 * 2 * 9 = 126, потім 1 * 2 * 6 = 12 і в результаті 1 * 2 = 2
# 1000 -> 0
# 423 -> 8
# 33 -> 9
# 25 -> 0
# 1 -> 1

number = int(input("Введіть ціле число: "))

# Головний цикл, що повторює перемноження, поки результат не стане менше або рівним 9
while number > 9:
    result = 1
    while number > 0:
        digit = number % 10
        result *= digit
        number //= 10
    number = result

# Виведення остаточного результату
print(number)