"""Ваша програма має перенести останній елемент списку з кінця на початок, тобто,
останній елемент списку має стати першим. Послідовність інших елементів не має змінюватися.
Порожній список або список з одним елементом повинен залишитися незмінним.
Кількість елементів у списку може бути будь-яким – нуль та більше!"""



# primer
# [12, 3, 4, 10] => [10,12, 3, 4]
# [1] => [1]
# [] => []
# [12, 3, 4, 10, 8] => [8, 12, 3, 4, 10]


spisok = [12, 3, 4, 10]
if len(spisok) > 1:  # перевірка, чи довжина списку більша за 1
    last_element = spisok.pop()  # видаляємо останній елемент
    spisok.insert(0, last_element)  # вставляємо його на початок
print(spisok)