# Модифікувати калькулятор таким чином, щоб він працював доти, доки користувач цього хоче.
# Тобто, потрібно робити запит до користувача на продовження роботи калькулятора після кожного обчислення
# - якщо користувач ввів yes (можна просто y), то нове обчислення, інакше - закінчення роботи.

while True:
    # Получение операции от пользователя
    print("Выберите операцию:")
    print("1. Умножение")
    print("2. Деление")
    print("3. Прибавление")
    print("4. Отбавление")
    операция = input("Введите номер операции (1/2/3/4): ")

    # Получение переменных от пользователя
    число1 = float(input("Введите первое число: "))
    число2 = float(input("Введите второе число: "))

    # Выполнение операции и вывод результата
    if операция == '1':
        print("Результат умножения:", число1 * число2)
    elif операция == '2':
        if число2 == 0:
            print("Ошибка: деление на ноль")
        else:
            print("Результат деления:", число1 / число2)
    elif операция == '3':
        print("Результат прибавления:", число1 + число2)
    elif операция == '4':
        print("Результат отбавления:", число1 - число2)
    else:
        print("Ошибка: Некорректная операция")

    # Спрашиваем пользователя, хочет ли он продолжить или выйти
    ответ = input("Хотите продолжить (y/n)? ")
    if ответ.lower() != 'y':
        print("END")
        break