# # ДЗ 4.1. Перемістити всі нулі до кінця списку
# Написати програму, яка переміщає всі нулі у кінець списку.
# Ваше завдання — змінити список так, щоб усі нулі опинилися наприкінці списку.
# Порядок ненульових чисел має зберегтися!

#
#cikl
#ciklom spisok i chisla chto ne 0
#sozdaem noviy spisok

nums = [0, 1, 0, 12, 3]

# Формуємо новий список з ненульовими елементами (циклом for)
new_nums = [num for num in nums if num != 0]

# Додаємо нулі в кінець нового списку у кількості, яка відповідає кількості нулів у вихідному списку
zero_count = nums.count(0)
new_nums.extend([0] * zero_count)

# Замінюємо вихідний список новим
nums[:] = new_nums

print(nums)

